In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name": ['Abhi','Akshu','Mayur','Aarti'],
    "marks": [20,19,18,17],
    "city": ['Dombivli','Thane','Kalyan','Mulund']    
}

In [3]:
df = pd.DataFrame(dict)
df

    name  marks      city
0   Abhi     20  Dombivli
1  Akshu     19     Thane
2  Mayur     18    Kalyan
3  Aarti     17    Mulund

In [4]:

type(df)

pandas.core.frame.DataFrame

In [5]:
df.loc[df['marks'] == 20]['name']

0    Abhi
Name: name, dtype: object

In [6]:
df.iloc[1]

name     Akshu
marks       19
city     Thane
Name: 1, dtype: object

In [7]:
df.index = ['first','second','third','fourth']
df

         name  marks      city
first    Abhi     20  Dombivli
second  Akshu     19     Thane
third   Mayur     18    Kalyan
fourth  Aarti     17    Mulund

In [8]:
df.loc['second','name']

'Akshu'

In [9]:
df.reset_index(inplace=True)

In [10]:
df

    index   name  marks      city
0   first   Abhi     20  Dombivli
1  second  Akshu     19     Thane
2   third  Mayur     18    Kalyan
3  fourth  Aarti     17    Mulund

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:

df

    index   name  marks      city
0   first   Abhi     20  Dombivli
1  second  Akshu     19     Thane
2   third  Mayur     18    Kalyan
3  fourth  Aarti     17    Mulund

In [13]:
df['index']

0     first
1    second
2     third
3    fourth
Name: index, dtype: object

In [14]:
df.drop(columns=['index'],inplace=True)

In [15]:
df

    name  marks      city
0   Abhi     20  Dombivli
1  Akshu     19     Thane
2  Mayur     18    Kalyan
3  Aarti     17    Mulund

In [16]:
df['_%_'] = [ (i /50) * 100 for i in df['marks'] ]
df

    name  marks      city   _%_
0   Abhi     20  Dombivli  40.0
1  Akshu     19     Thane  38.0
2  Mayur     18    Kalyan  36.0
3  Aarti     17    Mulund  34.0

In [17]:
df2 = {
    "name":'Abhijit',
    "marks":10,
    "city": 'Mumbai',
    "_%_":20.0
}
df = df.append(df2,ignore_index=True)
df

C:\Users\abhij\AppData\Local\Temp\ipykernel_21364\2762401241.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2,ignore_index=True)

      name  marks      city   _%_
0     Abhi     20  Dombivli  40.0
1    Akshu     19     Thane  38.0
2    Mayur     18    Kalyan  36.0
3    Aarti     17    Mulund  34.0
4  Abhijit     10    Mumbai  20.0

In [18]:
df3 = pd.DataFrame({
    "name": ['Abhi','Akshu','Mayur','Aarti'],
    "marks": [20,19,18,17],
    "city": ['Dombivli','Thane','Kalyan','Mulund']    
})
df3

    name  marks      city
0   Abhi     20  Dombivli
1  Akshu     19     Thane
2  Mayur     18    Kalyan
3  Aarti     17    Mulund

In [19]:
df4 = df.merge(df3,on = 'name',how='left',sort=True,indicator=True)
df4

      name  marks_x    city_x   _%_  marks_y    city_y     _merge
0    Aarti       17    Mulund  34.0     17.0    Mulund       both
1     Abhi       20  Dombivli  40.0     20.0  Dombivli       both
2  Abhijit       10    Mumbai  20.0      NaN       NaN  left_only
3    Akshu       19     Thane  38.0     19.0     Thane       both
4    Mayur       18    Kalyan  36.0     18.0    Kalyan       both

In [20]:
df4.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [21]:
df5 = pd.concat([df,df3])

In [22]:
df5

      name  marks      city   _%_
0     Abhi     20  Dombivli  40.0
1    Akshu     19     Thane  38.0
2    Mayur     18    Kalyan  36.0
3    Aarti     17    Mulund  34.0
4  Abhijit     10    Mumbai  20.0
0     Abhi     20  Dombivli   NaN
1    Akshu     19     Thane   NaN
2    Mayur     18    Kalyan   NaN
3    Aarti     17    Mulund   NaN

In [23]:
df5.loc[df['name']=='Aarti','_%_'] = 34.0

In [26]:
df5 = df5.rename(columns={'name': 'Name'})
df5

      Name  marks      city   _%_
0     Abhi     20  Dombivli  40.0
1    Akshu     19     Thane  38.0
2    Mayur     18    Kalyan  36.0
3    Aarti     17    Mulund  34.0
4  Abhijit     10    Mumbai  20.0
0     Abhi     20  Dombivli   NaN
1    Akshu     19     Thane   NaN
2    Mayur     18    Kalyan   NaN
3    Aarti     17    Mulund  34.0

In [ ]:
df5.loc[~(df5.duplicated())]

In [ ]:
type(df5['name'])

In [ ]:
type(df5)

In [ ]:
type(df5.iloc[0])

In [ ]:
df5.info()

In [ ]:
df5['marks'] = np.array(df5['marks'],dtype='float64')

In [ ]:
type(df5['marks'])

In [ ]:
df5.ndim

In [ ]:
l = [1,2,3,4,5,12,1,2,3,4,]
n=set(l)
n.add(99)
n

In [ ]:
n.remove(99)

In [ ]:
n

In [ ]:
a = np.arange(9)
a

In [ ]:
a = a.reshape(3,3)
a

In [ ]:
b = np.arange(14,23)
b

In [ ]:
b = b.reshape(3,3)
b

In [ ]:
a+b

In [ ]:
a*b

In [ ]:
np.dot(a,b)

In [ ]:
a

In [ ]:
b

In [ ]:
np.cross(a,b)

In [ ]:
x = np.array([[1,2,3], [4,5,6], [7, 8, 9]])
y = np.array([[7, 8, 9], [4,5,6], [1,2,3]])
np.cross(x, y)

In [ ]:
x

In [ ]:
y

In [ ]:
c = a.ravel()

In [ ]:
c.shape

In [ ]:
d = np.array([1,2,3],ndmin=2)
d